UNFCOPY.саУНФУправлениеАссортиментом/src/Documents/ПеремещениеЗапасов/ПеремещениеЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="c63e7296-8bd5-4572-b1ca-d62e9d4681b3">
  <name>ПеремещениеЗапасов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>СтруктурнаяЕдиницаРеципиент</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказСнабжения</name>
    <type>
      <types>DocumentRef.саУНФ_ЗаказСнабжения</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="2f9254d3-924b-4caf-b47a-628781e5adb8">
    <name>СтруктурнаяЕдиница</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9ed471c0-7303-4652-b434-1027727c5b67">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2ea1fc21-bf58-41ff-9b62-421a3ffc846f">
    <name>Ячейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f202ea25-5f08-454c-bcd4-d55a2675affb">
    <name>СтруктурнаяЕдиницаПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="93db1c83-ec44-4e17-a675-b53a1859d1b5">
    <name>ЯчейкаПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="739c93ad-81cc-401b-95f3-ec81b0e6ca07">
    <name>ЗаказПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="aa5b33fe-cf43-49b9-b5ea-b7826671f562">
    <name>ВидОперации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b99b4c3c-b6c9-4d5b-a573-3969efe6420f">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6fcc9ac8-8471-48b7-a809-243a1da6d33e">
    <name>СчетЗатрат</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="89592531-f8c0-4bcf-b2f0-fc6a8387e335">
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="743962e9-651e-42ac-9605-ee91b64795aa">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="259b7032-9476-4cfe-97a1-7a2faa232a3c">
    <name>АдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9627732b-060e-4169-a38e-bd066c80b5bd">
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>саУНФ_МаршрутныйЛист</name>
    <type>
      <types>DocumentRef.МаршрутныйЛист</types>
    </type>
  </attributes>
  <attributes>
    <name>ПАК_МаршрутныйЛист</name>
    <type>
      <types>DocumentRef.ПАК_МаршрутныйЛист</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийОбъем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>7</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаТариф</name>
    <type>
      <types>CatalogRef.ЗоныТарифыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>саУНФ_Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>саУНФ_СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>саУНФ_НДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>саУНФ_СуммаСНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонКурьера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеСборки</name>
    <type>
      <types>EnumRef.СостояниеСборки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗагрузкиАвтомобиля</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="bc903c70-92bd-4b1f-98b2-ad50b8bb044c">
    <name>Автомобиль</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Доставлен</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИОВодителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВодительПосторонний</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections extendedConfigurationObject="2e1d10ce-4594-477f-ace1-dcad764157ce">
    <name>Запасы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="9c8e5c4e-d9b1-415a-8d9c-77359fe3b5f3">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="c5cd63d4-614d-4f48-8364-002d2b3b99d3">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="57001e53-e9c9-434b-8225-eaf7c072766b">
      <name>СтранаПроисхождения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f890776d-32fc-4a55-888f-ab5f04372bb2">
      <name>ЕдиницаИзмерения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="0ab759b1-5453-423a-9808-dae7f0d62e7d">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="594d5818-02d3-4902-811e-e8692cc12658">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8be5842e-e9d5-4f18-90f6-545c2288eb9c">
      <name>Партия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5866a844-b943-40f0-bdbe-1ccd88b0dec7">
      <name>СерийныеНомера</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="94f0835b-0bc7-40b5-af7a-b49634e874d8">
      <name>Резерв</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="93c6f638-bc15-47b7-9268-7d8a77d4ca28">
      <name>Себестоимость</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="16492692-d666-4064-915d-c87d37cab732">
      <name>ЗаказПокупателя</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="56d9e4e7-504d-473f-8b32-a333950aa29b">
      <name>НомерГТД</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>АвторСтроки</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="31b17715-fded-490d-bd7b-902d2aa45fc0">
    <name>ИнвентарьИХозяйственныеПринадлежности</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="b0376bce-8de0-4583-9d10-ca0a049ef9fa">
      <name>Партия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8f0973ad-5d27-4511-9a5d-668155331f27">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="9c9f1c41-0aa7-481c-8675-67bc901f11eb">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="32a7d162-bb4a-4a5a-8904-ba89fe9e80c0">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="8aa09fac-5d52-484f-b4ee-a5a2a0108c13">
      <name>ЕдиницаИзмерения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f329d3fb-e7e1-4b98-a9f1-35c6e9481b66">
      <name>СтранаПроисхождения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7c0b7a0b-3fd8-41e2-88be-e39a8e868bf9">
      <name>НомерГТД</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="2bb02e54-8fce-4430-ba51-da10d5ade522">
    <name>Спецоснастка</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="476c7825-8781-4c26-9466-89f22a8ecc43">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="94a5c934-c13d-428d-b932-5af199cb6b96">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e865d647-d7e8-49fa-87af-2bf990f1dcc2">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="f1126107-3afe-4141-a667-d32f47152247">
      <name>Партия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="41873ec5-d568-4b6c-8906-2f1b46310515">
      <name>ЕдиницаИзмерения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="490a4e3d-72fd-43ff-bc05-fdcc0f29cbf1">
      <name>СтранаПроисхождения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="3778f50d-bec4-44aa-aaa2-ab522191fdde">
      <name>НомерГТД</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

UNFCOPY.саУНФУправлениеАссортиментом/src/InformationRegisters/caУНФ_ФилиалыДляАвтозаказа/caУНФ_ФилиалыДляАвтозаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>caУНФ_ФилиалыДляАвтозаказа</name>
  <resources>
    <name>Включить</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтрольВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UNFCOPY.саУНФУправлениеАссортиментом/src/InformationRegisters/caУНФ_ТочкиДляАвтозаказа/caУНФ_ТочкиДляАвтозаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>caУНФ_ТочкиДляАвтозаказа</name>
  <resources>
    <name>Включить</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗапретПеремещения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтгружатьДеньВДень</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Точка</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UNFCOPY.саУНФУправлениеАссортиментом/src/Documents/ПеремещениеЗапасов/Forms/ФормаДокумента/Module.bsl
#Область ОткрытьЗаписать
&НаСервере
Процедура саУНФ_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() И ЗначениеЗаполнено(Параметры.Основание) Тогда
		Если ТипЗнч(Параметры.Основание)=Тип("ДокументСсылка.саУНФ_ЗаказСнабжения")  Тогда
			
			Если ЗначениеЗаполнено(Параметры.Основание.ВариантЗавершения) Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("На основании документа с вариантом завершения %1 перемещение вводить нельзя",Строка(Параметры.Основание.ВариантЗавершения));
				Сообщение.Сообщить();
				Отказ = Истина;
			Иначе
				ОМ =  ОбщегоНазначения.ОбщийМодуль("саУНФ_АтозаказВызовСервера");    
				Если  НЕ ОМ = Неопределено Тогда
					Если НЕ ОМ.НайтиДокументОснование(Параметры.Основание,Параметры.Основание.Дата) Тогда
						Сообщение = Новый СообщениеПользователю;
						Сообщение.Текст = СтрШаблон("На основании документа  %1 перемещение уже создано",Строка(Параметры.Основание));
						Сообщение.Сообщить();
						Отказ = Истина;
					КонецЕсли; 
				КонецЕсли; 
				
			КонецЕсли; 
			
			
		КонецЕсли; 
		
		
	КонецЕсли; 
	ОтветДобавлени = Ложь;
	ВидимостьЗаказаПокупателя = истина;
	Если ЗначениеЗаполнено(Объект.ЗаказСнабжения) Тогда
		ВидимостьЗаказаПокупателя = Ложь;
		ПоместитьТаблицуВХранилище();
	КонецЕсли; 	
	
	Элементы.Заполнить.Видимость															=	ВидимостьЗаказаПокупателя;
	Элементы.ЗапасыИзменитьРезерв.Видимость 										= 	ВидимостьЗаказаПокупателя;
	Элементы.ЗаказПокупателя.Видимость 												=	ВидимостьЗаказаПокупателя;
	Элементы.ЗаполнитьПоЗаказу.Видимость 											= 	ВидимостьЗаказаПокупателя;
	Элементы.ЗапасыИзменитьРезервЗаполнитьПоРезервам.Видимость		=	ВидимостьЗаказаПокупателя;
	Элементы.ЗапасыИзменитьРезервОчиститьРезерв.Видимость				=	ВидимостьЗаказаПокупателя;
	Элементы.ЗаполнитьПоОстаткамНаСкладе.Видимость							=	ВидимостьЗаказаПокупателя;
	Элементы.ЗапасыКопироватьСтроки.Видимость                                   	=  ВидимостьЗаказаПокупателя;
	Элементы.ЗапасыВставитьСтроки.Видимость                                   		=  ВидимостьЗаказаПокупателя;
	Элементы.ЗапасыЗагрузитьДанныеИзТСД.Видимость                           =  ВидимостьЗаказаПокупателя;
	Элементы.ЗапасыПолучитьВес.Видимость                                           	=  ВидимостьЗаказаПокупателя;
	Элементы.ЗапасыРезерв.Видимость														=	ВидимостьЗаказаПокупателя;
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ДатаОтгрузки", Тип("ПолеФормы"),Элементы.ГруппаЗаказОснование);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ТолькоПросмотр = Ложь;
	НовыйЭлемент.ПутьКДанным = "Объект.ДатаОтгрузки";

	
	Если НЕ  ВидимостьЗаказаПокупателя  Тогда
		НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ЗаказСнабжения", Тип("ПолеФормы"),Элементы.ГруппаЗаказОснование);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ТолькоПросмотр = Истина;
		НовыйЭлемент.ПутьКДанным = "Объект.ЗаказСнабжения";
		
		Кмд = ЭтаФорма.Команды.Добавить("КомандаЗаполнитьПоЗаказуСнабжения");
		Кмд.Действие = "ЗаполнитьПоЗаказуСнабжения";
		Кмд.Заголовок = "Заполнить по заказу";
		Кмд.Картинка = БиблиотекаКартинок.ЗаполнитьПоОснованию;
		Кмд.Отображение = ОтображениеКнопки.Картинка;
		
		
		НовыйЭлемент = ЭтаФорма.Элементы.Добавить("КнопкаЗаказСнабжения", Тип("КнопкаФормы"),Элементы.ГруппаЗаказОснование);
		НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		НовыйЭлемент.ИмяКоманды = "КомандаЗаполнитьПоЗаказуСнабжения";
		НовыйЭлемент.Заголовок = "";
		
		НовыйЭлемент = ЭтаФорма.Элементы.Добавить("АвторСтроки",Тип("ПолеФормы"),Элементы.Запасы);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеТабличногоДокумента;
		НовыйЭлемент.ПутьКДанным = "Объект.Запасы.АвторСтроки";
		НовыйЭлемент.ТолькоПросмотр = Истина;
		
																				 
	КонецЕсли;                                                                                
	    Элементы.ГруппаПраво.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		
		СтруктураЭлементов = Новый Структура("ПАК_МаршрутныйЛист", "Объект.ПАК_МаршрутныйЛист");
		СтруктураЭлементов.Вставить("ЗонаТариф", "Объект.ЗонаТариф");
		СтруктураЭлементов.Вставить("ТелефонКурьера", "Объект.ТелефонКурьера");
		СтруктураЭлементов.Вставить("ДатаЗагрузкиАвтомобиля", "Объект.ДатаЗагрузкиАвтомобиля");
		СтруктураЭлементов.Вставить("Автомобиль", "Объект.Автомобиль");
		
		 Для каждого СтрСтруктуры Из СтруктураЭлементов Цикл
			 НовыйЭлемент = ЭтаФорма.Элементы.Добавить(СтрСтруктуры.Ключ,Тип("ПолеФормы"),Элементы.ГруппаПраво);
			 НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
			 НовыйЭлемент.ПутьКДанным = СтрСтруктуры.Значение;
		 КонецЦикла; 
		 
		 НовыйЭлемент = ЭтаФорма.Элементы.Добавить("Доставлен",Тип("ПолеФормы"),Элементы.ГруппаПраво);
		 НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		 НовыйЭлемент.ПутьКДанным = "Объект.Доставлен";

	   	
КонецПроцедуры

&НаКлиенте
Процедура саУНФ_ПередЗаписьюПеред(Отказ, ПараметрыЗаписи)
	Если Модифицированность Тогда
		
		Если Обломчикус() И  НЕ ОтветДобавления Тогда
			Отказ = Истина;
			
			Режим = Новый СписокЗначений;
			Режим.Добавить("Отказать","Ой сорри. Отказываюсь от изменения");
			Режим.Добавить("Добавить","Понимаю, но все-равно изменю");
			П=Новый Структура;
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаДобавления", ЭтотОбъект, П);
			ПоказатьВопрос(Оповещение,"Документы уже распечатаны, идет сборка заказа. Что думаете?", Режим,30, "Отказать");
			
			
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

#КонецОбласти 

#Область ВспомогательныеФункции

&НаКлиенте
Процедура ЗаполнитьПоЗаказуСнабжения(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПоЗаказуСнабженияЗавершение", ЭтотОбъект), НСтр("ru = 'Документ будет полностью перезаполнен по ""Заказу покупателя"". Продолжить выполнение операции?'"), РежимДиалогаВопрос.ДаНет, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоЗаказуСнабженияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Ответ = Результат;
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаполнитьПоДокументу(Объект.ЗаказСнабжения);
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьПоЗаказу()

&НаСервере
Функция ЭтоДоставкаВМинск()
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	caУНФ_ФилиалыДляАвтозаказа.Филиал КАК Филиал
	|ИЗ
	|	РегистрСведений.caУНФ_ФилиалыДляАвтозаказа КАК caУНФ_ФилиалыДляАвтозаказа
	|ГДЕ
	|	caУНФ_ФилиалыДляАвтозаказа.Включить
	|	И caУНФ_ФилиалыДляАвтозаказа.КонтрольВремени";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Если ПривилегированныйРежим() Тогда
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли; 
		
		Возврат Ложь;
	КонецЕсли; 
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Если Выборка.Филиал=Объект.СтруктурнаяЕдиницаПолучатель Тогда
		Если ПривилегированныйРежим() Тогда
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли; 
		
		Возврат Истина;
	Иначе	
		Если ПривилегированныйРежим() Тогда
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли; 
		Возврат Ложь;
	КонецЕсли; 
	
КонецФункции // ()
 
&НаСервере
Функция ДеньВДень()
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	caУНФ_ТочкиДляАвтозаказа.Точка КАК Точка
		|ИЗ
		|	РегистрСведений.caУНФ_ТочкиДляАвтозаказа КАК caУНФ_ТочкиДляАвтозаказа
		|ГДЕ
		|	caУНФ_ТочкиДляАвтозаказа.Точка = &Точка";
	
	Запрос.УстановитьПараметр("Точка", Объект.СтруктурнаяЕдиницаПолучатель);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Если ПривилегированныйРежим() Тогда
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли; 
		
		Возврат Ложь;
	КонецЕсли; 
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Если Выборка.Точка=Объект.СтруктурнаяЕдиницаПолучатель Тогда
		Если ПривилегированныйРежим() Тогда
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли; 
		
		Возврат Истина;
	Иначе	
		Если ПривилегированныйРежим() Тогда
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли; 
		Возврат Ложь;
	КонецЕсли; 
КонецФункции // ()
 

&НаСервере
Функция ВремяВышло()
	Если саУНФ_ОбщийМодуль.ЕстьРоль("саУНФ_РазрешениеПеремещенияЗапасовПосле14") Тогда
	
		Возврат Истина;
	
	КонецЕсли; 

	
	ОМ =  ОбщегоНазначения.ОбщийМодуль("саУНФ_АтозаказВызовСервера");    
	Если  НЕ ОМ = Неопределено Тогда
		ДоставкаВМинск = ЭтоДоставкаВМинск();
		ДеньВДень=Ложь;
		Если НЕ ДоставкаВМинск Тогда
		      ДеньВДень=ДеньВДень();
		КонецЕсли; 
		
		Возврат ОМ.ПроверкаВремени(Объект.ЗаказСнабжения.Дата,ДоставкаВМинск,ДеньВДень);
	Иначе
		Возврат Истина;
	КонецЕсли; 
	
КонецФункции // ()

&НаКлиенте
Функция Обломчикус()
	//Возврат  Ложь;
	
	
	Если ЗначениеЗаполнено(Объект.ЗаказСнабжения) Тогда
		Если НЕ ВремяВышло() Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Это перемещение по автозаказу. Добавлять товар после 14:00 запрещено.(для доставки в Минск после 11:00)";
			Сообщение.Сообщить();
			Возврат Истина;
		КонецЕсли; 
	КонецЕсли; 
	
	Возврат Ложь;
	
КонецФункции

&наСервере
Процедура УстановитьАвтораСтроки(Идентификатор)
	ТекущиеД = Объект.Запасы.НайтиПоИдентификатору(Идентификатор);
	ТекущиеД.АвторСтроки = Пользователи.ТекущийПользователь();
КонецПроцедуры

&НаСервере
Процедура ПроверитьАвтораСтроки(Идентификатор,Отказ)
	ТекущиеД = Объект.Запасы.НайтиПоИдентификатору(Идентификатор);
	Если ТекущиеД.АвторСтроки <> Пользователи.ТекущийПользователь() И ЗначениеЗаполнено(ТекущиеД.Номенклатура) Тогда
		Отказ = Истина;
	Иначе
		Отказ = Ложь;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция   ПроверитьСуществованиеНоменклатурыНаСервере(Идентификатор)
	ТекущиеД = Объект.Запасы.НайтиПоИдентификатору(Идентификатор);
	Если НЕ ЗначениеЗаполнено(ТекущиеД.Номенклатура) Тогда
	      Возврат Ложь;
	КонецЕсли; 
	
	СписокОтбора = Новый Структура("Номенклатура",ТекущиеД.Номенклатура);
	ТаблицаЧ= ПолучитьИзВременногоХранилища(АдресХранилища);
	МассивЧек = ТаблицаЧ.НайтиСтроки(СписокОтбора);
	Если МассивЧек.Количество()>0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции



&НаСервере
Процедура   ВернутьНоменклатуруНаСервере(Идентификатор,Индекс)
	ТаблицаЧ= ПолучитьИзВременногоХранилища(АдресХранилища);
	Если ТаблицаЧ.Количество()<=Индекс  Тогда
			
	Иначе			 
		СтрокаТаблицыЧ = ТаблицаЧ[Идентификатор];
		ТекущиеД = Объект.Запасы.НайтиПоИдентификатору(Идентификатор);
		ТекущиеД.Номенклатура = СтрокаТаблицыЧ.Номенклатура;
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Функция ВернутьНоменклатуру(Элемент,Предупреждать=Истина)
	Если ТипЗнч(Элемент)=Тип("Число") Тогда
	    Идентификатор = Элемент;
		ТекущаяСтр =      Элемент;
	Иначе	
	    Идентификатор =Элемент.ТекущиеДанные.ПолучитьИдентификатор();
		ТекущаяСтр = Элемент.ТекущаяСтрока;
	КонецЕсли; 
	
	//Если  Элемент.ТекущийЭлемент.Имя = "ЗапасыНоменклатура" Тогда
		Отказ = Ложь;
		//номенклатуру из автозаказа никто изменять не может, можно только удалить
		//свою номенклатуру можно изменять
		ПроверитьАвтораСтроки(Идентификатор,Отказ);
		Если Отказ  И Предупреждать Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Можно менять количество. Изменять можно только ту номенклатуру, которую вы сами ввели.";
			Сообщение.Сообщить();	
			ВернутьНоменклатуруНаСервере(Идентификатор,ТекущаяСтр);
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли; 
	//КонецЕсли; 
	
	Возврат Ложь;
	
КонецФункции				


&НаСервере
&Вместо("ПолучитьЗапасыИзХранилища")
Процедура саУНФ_ПолучитьЗапасыИзХранилища(АдресЗапасовВХранилище, ИмяТабличнойЧасти, ЕстьХарактеристики, ЕстьПартии)
	Если НЕ  ВидимостьЗаказаПокупателя  Тогда
		
		
		ТаблицаДляЗагрузки = ПолучитьИзВременногоХранилища(АдресЗапасовВХранилище);
		
		СтруктураДанныеНоменклатуры = Новый Структура;
		СтруктураДанныеНоменклатуры.Вставить("ВидОперации", Объект.ВидОперации);
		СтруктураДанныеНоменклатуры.Вставить("Организация", Объект.Организация);
		
		Для каждого СтрокаЗагрузки Из ТаблицаДляЗагрузки Цикл
			Если ИмяТабличнойЧасти="Запасы" Тогда
				ВвестиАвтора = Истина;
				КоличествоВСтроке = 0;				
				СписокОтбора = Новый Структура("Номенклатура",СтрокаЗагрузки.Номенклатура);
				МассивСтрок = Объект[ИмяТабличнойЧасти].НайтиСтроки(СписокОтбора);
				
				Если МассивСтрок.Количество() =0 Тогда
					НоваяСтрока = Объект[ИмяТабличнойЧасти].Добавить();
				Иначе
					ВвестиАвтора = Ложь;;
					НоваяСтрока = МассивСтрок[0];
					КоличествоВСтроке = НоваяСтрока.Количество +СтрокаЗагрузки.Количество;
				КонецЕсли; 
			Иначе	
				НоваяСтрока = Объект[ИмяТабличнойЧасти].Добавить();
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗагрузки);
			Если ИмяТабличнойЧасти="Запасы" Тогда
				ЗаполнениеОбъектовУНФ.ЗаполнитьСтрокуПоШапке(НоваяСтрока, Объект, "ЗаказПокупателя", "ПоложениеЗаказаПокупателя");			
			КонецЕсли; 
			
			Если ИмяТабличнойЧасти="Запасы" Тогда
				Если  КоличествоВСтроке>0 Тогда
					НоваяСтрока.Количество =  КоличествоВСтроке;
				КонецЕсли;
			КонецЕсли;
			
			// Характеристики
			СтруктураДанныеНоменклатуры.Вставить("Номенклатура", СтрокаЗагрузки.Номенклатура);
			СтруктураДанныеНоменклатуры.Вставить("Характеристика", СтрокаЗагрузки.Характеристика);
			
			СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанныеНоменклатуры);
			
			НоваяСтрока.ИспользоватьХарактеристики = СтруктураДанные.ИспользоватьХарактеристики;
			НоваяСтрока.ПроверятьЗаполнениеХарактеристики = СтруктураДанные.ПроверятьЗаполнениеХарактеристики;
			НоваяСтрока.ЗаполнениеХарактеристикиПроверено = Истина;
			
			Если СтруктураДанные.ИспользоватьХарактеристики
				Тогда
				НоваяСтрока.Характеристика = СтруктураДанные.Характеристика;
			КонецЕсли;
			// Конец Характеристики
			
			//Партии
			НоваяСтрока.ИспользоватьПартии = ?(ИмяТабличнойЧасти = "Отходы", Истина, СтруктураДанные.ИспользоватьПартии);
			НоваяСтрока.ПроверятьЗаполнениеПартий = СтруктураДанные.ПроверятьЗаполнениеПартий;
			
			НоваяСтрока.Партия = ?(ЗначениеЗаполнено(СтрокаЗагрузки.Партия), СтрокаЗагрузки.Партия, СтруктураДанные.Партия);
			// Конец Партии
			
			НоваяСтрока.СтранаПроисхождения = СтруктураДанные.СтранаПроисхождения;
			НоваяСтрока.НомерГТД = СтруктураДанные.НомерГТД;
			//***Начало***12.08.2021***МурашкоВ
			Если ВвестиАвтора Тогда
			        НоваяСтрока.АвторСтроки  =  Пользователи.ТекущийПользователь();
			КонецЕсли; 
			//***Конец***12.08.2021***МурашкоВ
		КонецЦикла;
		
	Иначе
		ПродолжитьВызов(АдресЗапасовВХранилище, ИмяТабличнойЧасти, ЕстьХарактеристики, ЕстьПартии);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПроверитьКоличествоДо(Идентификатор,Отказ)
	//можно делать меньше только свою строку
	ТекущиеД = Объект.Запасы.НайтиПоИдентификатору(Идентификатор);
	СписокОтбора = Новый Структура("Номенклатура",ТекущиеД.Номенклатура);
	ТаблицаЧ= ПолучитьИзВременногоХранилища(АдресХранилища);
	МассивЧек = ТаблицаЧ.НайтиСтроки(СписокОтбора);
	Если МассивЧек.Количество()>0 Тогда
		Если МассивЧек[0].Количество > ТекущиеД.Количество Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Вы не можете ввести количество, меньше, чем в документе";
			Сообщение.Сообщить();
			ТекущиеД.Количество =  МассивЧек[0].Количество;
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПоместитьТаблицуВХранилище()
	ТаблицаЧ=Объект.Запасы.Выгрузить();
	АдресХранилища = ПоместитьВоВременноеХранилище(ТаблицаЧ,ЭтаФорма.УникальныйИдентификатор);
КонецПроцедуры



&НаСервере
&Вместо("ВставитьСтрокиНаСервере")
Процедура саУНФ_ВставитьСтрокиНаСервере(ИмяТЧ, КоличествоСкопированных, КоличествоВставленных)
	Если НЕ  ВидимостьЗаказаПокупателя  Тогда
		Возврат;
	Иначе
		ПродолжитьВызов(ИмяТЧ, КоличествоСкопированных, КоличествоВставленных);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаДобавления(Результат, Параметры) Экспорт
	Если Результат = "Отказать" Тогда
		Возврат;
	Иначе
		ОтветДобавления=Истина; 
		Записать();
		ОтветДобавления  = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЖмемКнопки

&НаКлиенте
Процедура саУНФ_ПодборВместо(Команда)
	Если Обломчикус() Тогда
		Возврат;
	КонецЕсли; 
	ПодобратьТовары("Запасы");
КонецПроцедуры

&НаКлиенте
Процедура саУНФ_ЗапасыКопироватьСтрокиВместо(Команда)
	Если Обломчикус() Тогда
		Возврат;
	КонецЕсли; 
	
	КопироватьСтроки("Запасы");
КонецПроцедуры

&НаКлиенте
Процедура саУНФ_ЗапасыВставитьСтрокиВместо(Команда)
	Если Обломчикус() Тогда
		Возврат;
	КонецЕсли; 
	ВставитьСтроки("Запасы");
КонецПроцедуры

&НаКлиенте
Процедура саУНФ_ИзменитьРезервЗаполнитьПоРезервамВместо(Команда)
	Если Обломчикус() Тогда
		Возврат;
	КонецЕсли; 
	
	Если Объект.Запасы.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Табличная часть ""Запасы"" не заполнена!'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ЗаполнитьКолонкуРезервПоРезервамНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура саУНФ_ИзменитьРезервОчиститьРезервВместо(Команда)
	Если Обломчикус() Тогда
		Возврат;
	КонецЕсли; 
	
	
	Если Объект.Запасы.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Табличная часть ""Запасы"" не заполнена!'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаТабличнойЧасти Из Объект.Запасы Цикл
		СтрокаТабличнойЧасти.Резерв = 0;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура саУНФ_ЗаполнитьПоОстаткамНаСкладеВместо(Команда)
	Если Обломчикус() Тогда
		Возврат;
	КонецЕсли; 
	
	ЗаполнитьПоОстаткамНаСкладеНачало("Запасы");
КонецПроцедуры

#КонецОбласти


#Область ИнтерактивноеИзменение

&НаКлиенте
Процедура саУНФ_ЗапасыПередНачаломДобавленияПеред(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если НЕ ВидимостьЗаказаПокупателя Тогда
	Отказ =Обломчикус();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередУдалениемНаСервере(Идентификатор,Отказ)
	
	//Если НЕ ВидимостьЗаказаПокупателя И НЕ саУНФ_ОбщийМодуль.ЕстьРоль("саУдалениеСтрокВПеремещенииПоАвтозаказу") Тогда
	ПроверитьАвтораСтроки(Идентификатор,Отказ);
	Если Отказ Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Вам можно удалять (изменять) только товар, который вы сами добавили";
		Сообщение.Сообщить();
	КонецЕсли; 
	//КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура саУНФ_ЗапасыПередУдалениемПеред(Элемент, Отказ)
	Если НЕ ВидимостьЗаказаПокупателя И НЕ саУНФ_ОбщийМодуль.ЕстьРоль("саУдалениеСтрокВПеремещенииПоАвтозаказу") Тогда
		Отказ=Обломчикус();
		Если Отказ Тогда
			Возврат;
		КонецЕсли; 
		ПередУдалениемНаСервере(Элемент.ТекущиеДанные.ПолучитьИдентификатор(),Отказ);
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура УдалитьСтрокуЗапасы()
	
	Объект.Запасы.Удалить(Объект.Запасы.Количество()-1);
	
КонецПроцедуры


&НаКлиенте
Процедура саУНФ_ЗапасыПриНачалеРедактированияПосле(Элемент, НоваяСтрока, Копирование)
	Если НЕ  ВидимостьЗаказаПокупателя  Тогда
		Если НЕ саУНФ_ОбщийМодуль.ЕстьРоль("саУдалениеСтрокВПеремещенииПоАвтозаказу") Тогда
			Отказ=Обломчикус();
			Если Отказ Тогда
				Отказ=ВернутьНоменклатуру(Элемент.ТекущиеДанные.ПолучитьИдентификатор(),Ложь);
				Возврат;
			КонецЕсли; 
		КонецЕсли;
		
		Если  Копирование Тогда
			//копировать нельзя	
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Копировать запрещено.";
			Сообщение.Сообщить();	
			УдалитьСтрокуЗапасы();
			Возврат;
		ИначеЕсли НоваяСтрока  Тогда
			//Проверим что такой номенклатуры нет в документе
			Отказ = ПроверитьСуществованиеНоменклатурыНаСервере(Элемент.ТекущиеДанные.ПолучитьИдентификатор());
			Если Отказ  Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Номенклатура уже есть в табличной части. Можете изменить количество";
				Сообщение.Сообщить();
				УдалитьСтрокуЗапасы();
				Возврат;
			КонецЕсли; 
			УстановитьАвтораСтроки(Элемент.ТекущиеДанные.ПолучитьИдентификатор());
			
		Иначе
			Предупреждать=Истина;
			Если Элемент.ТекущийЭлемент.Имя="ЗапасыКоличество" Тогда
			         Предупреждать=Ложь;
			КонецЕсли; 
			
			Отказ=ВернутьНоменклатуру(Элемент,Предупреждать);
			Если  Отказ Тогда Возврат; КонецЕсли; 
			
		КонецЕсли;	
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура саУНФ_ЗапасыПередОкончаниемРедактированияПеред(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Если НЕ  ВидимостьЗаказаПокупателя  Тогда

	Если Элемент.ТекущийЭлемент.Имя = "ЗапасыКоличество"  Тогда	   
		Если Элемент.ТекущиеДанные.Количество=0 Тогда
			//0 никто поставить не может
			ПроверитьКоличествоДо(Элемент.ТекущиеДанные.ПолучитьИдентификатор(),Отказ);
		Иначе  
			Если НЕ саУНФ_ОбщийМодуль.ЕстьРоль("саУдалениеСтрокВПеремещенииПоАвтозаказу") Тогда
				ПроверитьКоличествоДо(Элемент.ТекущиеДанные.ПолучитьИдентификатор(),Отказ);
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура саУНФ_ЗапасыПриОкончанииРедактированияПосле(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если НЕ  ВидимостьЗаказаПокупателя  Тогда
		
		Если НоваяСтрока  И НЕ Элемент.ТекущиеДанные=Неопределено Тогда
			//Проверим что такой номенклатуры нет в документе
			Отказ = ПроверитьСуществованиеНоменклатурыНаСервере(Элемент.ТекущиеДанные.ПолучитьИдентификатор());
			Если Отказ  Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Номенклатура уже есть в табличной части. Можете изменить количество";
				Сообщение.Сообщить();
				УдалитьСтрокуЗапасы();
				Возврат;
			Иначе
				ПоместитьТаблицуВХранилище();
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура саУНФ_ЗапасыПриИзмененииПосле(Элемент)
	Если НЕ  ВидимостьЗаказаПокупателя  Тогда
		Предупреждать=Истина;
			Если Элемент.ТекущийЭлемент.Имя="ЗапасыКоличество" Тогда
			         Предупреждать=Ложь;
			КонецЕсли; 
		
		Отказ= ВернутьНоменклатуру(Элемент,Предупреждать);
		Если  Отказ Тогда Возврат; КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры


#КонецОбласти
